In [7]:
import numpy as np
import pandas as pd

Pivot Tables

In [ ]:
# Pivot Table are use in aggregation function like (mean, median, mode, max, min, std, count)

In [14]:
data = {
    'Date': pd.date_range('2023-01-01', periods = 20),
    'Product': ['A','B','C','D'] * 5,
    'Region': ['East', 'West', 'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West', 'North', 'South'],
    'Sales': np.random.randint(100, 1000, 20),
    'Units': np.random.randint(10, 100, 20),
    'Rep': ['John', 'Mary', 'Bob', 'Alice','John', 'Mary', 'Bob', 'Alice','John', 'Mary', 'Bob', 'Alice','John', 'Mary', 'Bob', 'Alice','John', 'Mary', 'Bob', 'Alice']
}

df = pd.DataFrame(data)

df['Month'] = df['Date'].dt.month_name()
df['Quarter'] = 'Q' + df['Date'].dt.quarter.astype(str)

In [12]:
df

         Date Product Region  Sales  Units    Rep    Month Quarter
0  2023-01-01       A   East    251     18   John  January      Q1
1  2023-01-02       B   West    540     62   Mary  January      Q1
2  2023-01-03       C  North    751     54    Bob  January      Q1
3  2023-01-04       D  South    565     78  Alice  January      Q1
4  2023-01-05       A   East    486     69   John  January      Q1
5  2023-01-06       B   West    518     95   Mary  January      Q1
6  2023-01-07       C  North    493     28    Bob  January      Q1
7  2023-01-08       D  South    835     37  Alice  January      Q1
8  2023-01-09       A   East    363     78   John  January      Q1
9  2023-01-10       B   West    204     68   Mary  January      Q1
10 2023-01-11       C  North    844     14    Bob  January      Q1
11 2023-01-12       D  South    502     89  Alice  January      Q1
12 2023-01-13       A   East    492     74   John  January      Q1
13 2023-01-14       B   West    376     25   Mary  January      Q1
14 2023-01-15       C  North    325     54    Bob  January      Q1
15 2023-01-16       D  South    972     30  Alice  January      Q1
16 2023-01-17       A   East    233     84   John  January      Q1
17 2023-01-18       B   West    269     83   Mary  January      Q1
18 2023-01-19       C  North    452     45    Bob  January      Q1
19 2023-01-20       D  South    734     79  Alice  January      Q1

In [19]:
pd.pivot_table(df, values = 'Sales', index = 'Region', columns = 'Product', aggfunc = 'median')

Product      A      B      C      D
Region
East     400.0    NaN    NaN    NaN
North      NaN    NaN  459.0    NaN
South      NaN    NaN    NaN  331.0
West       NaN  427.0    NaN    NaN

In [25]:
pivot2 = pd.pivot_table(df, values = ['Sales', 'Units'], index = 'Region', columns = 'Product')
pivot2

         Sales                      Units
Product      A      B      C      D     A     B     C     D
Region
East     508.0    NaN    NaN    NaN  57.6   NaN   NaN   NaN
North      NaN    NaN  512.0    NaN   NaN   NaN  50.6   NaN
South      NaN    NaN    NaN  461.6   NaN   NaN   NaN  30.2
West       NaN  633.8    NaN    NaN   NaN  61.0   NaN   NaN

Cross Tabs

In [ ]:
# Cross tabs are use in counting purpose

In [26]:
pd.crosstab(df['Region'], df['Product'])

Product  A  B  C  D
Region
East     5  0  0  0
North    0  0  5  0
South    0  0  0  5
West     0  5  0  0